tutorials/multiphase/interFoam/les/nozzleFlow2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
axis
{
    type empty;
    physicalType empty;
    nFaces 0;
    startFace 41031;
}

inlet
{
    type patch;
    physicalType inlet;
    nFaces 30;
    startFace 41031;
}

wall
{
    type wall;
    physicalType wall;
    nFaces 70;
    startFace 41061;
}

atmosphere
{
    type patch;
    physicalType atmosphere;
    nFaces 175;
    startFace 41131;
}

front
{
    type wedge;
    physicalType wedge;
    nFaces 20603;
    startFace 41306;
}

back
{
    type wedge;
    physicalType wedge;
    nFaces 20603;
    startFace 61909;
}
)

// ************************************************************************* //
