tutorials/multiphase/interFoam/les/nozzleFlow2D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2            ( 0 1 0 );
}

patchLocalCoeffs
{
    patch           outside;
    tan1            ( 1 0 0 );
}

directions      ( tan1 );

useHexTopology  no;

geometricCut    yes;

writeMesh       no;

// ************************************************************************* //
